# Core shell tools for zsh
brew "zsh"
brew "stow"                    # GNU Stow for symlink management
brew "starship"                # Modern cross-shell prompt
brew "zsh-autosuggestions"     # Fish-like autosuggestions
brew "zsh-syntax-highlighting" # Real-time syntax highlighting
brew "zsh-completions"         # Additional completions

# Fonts
cask "font-jetbrains-mono" # Jetbrains font
cask "font-jetbrains-mono-nerd-font" # Nerd Font for Starship symbols

# Git and version control
brew "git"
brew "git-delta"               # Syntax-highlighted diffs

# Modern CLI replacements
brew "bat"                     # cat with syntax highlighting
brew "eza"                     # Modern ls replacement
brew "ripgrep"                 # Fast grep alternative
brew "fd"                      # Fast find alternative
brew "fzf"                     # Fuzzy finder for history/files

# Development tools
brew "direnv"                  # Directory-specific environment variables
brew "shellcheck"              # Shell script linter

# Graphics library
brew "molten-vk"

# Utilities
cask "rectangle"               # Window manager
cask "shottr"                  # Screenshot tool
cask "linearmouse"             # Mouse customization
# Go install AirpodsSanity from https://github.com/Gaulomatic/AirPodsSanity

# Applications
cask "visual-studio-code"      # Code editor
